Repository: zaidmahdidev/wide_space_task
Catalog: lib/l10n/app_*.arb
Languages: ar

source: amount to cashout
ar: المبلغ المراد سحبه

source: amount to cashin
ar: المبلغ المراد إيداعه

# subWalletDeleted
source: sub-deleted deleted
ar: تم حذف المحفظة الفرعية

# merchantCodeOrPhone
source: merchant code or phone number
ar: كود التاجر او رقم هاتفه

# requestedFromPhone
source: requested user phone number
ar: رقم هاتف المطلوب منه

# amountToLoan
source: amount you want to request
ar: المبلغ المراد إقتراضه

# pickServicePointLocation
source: please pick your service point location
ar: يرجى إختيار موقع نقطة خدمتك (أنقر للأختيار)

source: choose this location
ar: إختيار هذا الموقع

source: service point location selected
ar: تم إختيار موقع نقطة الخدمة (أنقر للتغير)

source: location description
ar: وصف الموقع

# uploadServicePointsImages
source: upload your service point images
ar: يرجى رفع صور نقطة الخدمة (أنقر للأختيار)

# servicePointsImagesUploaded
source: service point images selected
ar: تم إختيار صور نقطة الخدمة (أنقر للتغير)

source: all photos
ar: كل الصور

source: please allow required permissions
ar: يرجى الموافقة على إعطاء الصلاحيات اللازمة

# agentsAndMerchantLocations
source: agents and merchants locations
ar: مواقع الوكلاء والتجار

source: find nearest agent
ar: البحث عن اقرب وكيل (نقطة خدمة)

# showServiceLocationToOthers
source: show your service location to others
ar: إظهار موقع نقطة الخدمة لللآخرين

source: cant upload more than eight images
ar: لايمكنك رفع أكثر من ثمانية صور

# enterLogSecretPassword
source: Enter developer secret password
ar: قم بإدخال كلمة مرور المطور

# enterLogSecretPasswordDescription
source: entering the password wrong for many times will get your account blocked
ar: إدخال كلمة المرور بشكل خاطئ لعدة مرات سيعرض حسابك للحظر

# shareMessage
source: Hey You can now download NUQUD app from the bellow links and enjoy all payment features 🤩. ________________ Android Google Play: {androidLink} _________________ iOS App Store (Apple Devices - IPhones) {iOSLink}
ar: مرحباً، قم بتحميل تطبيق نقود على قوقل بلاي او آب ستور الآن على الراوابط التالية واستمتع بكل الخدمات المالية المقدمة 🤩. أندرويد {androidLink} آي او اس (أبل - آيفون) {iOSLink}

# subWalletDeletionAlert
source: this sub-wallet will be deleted .. sub-wallet user will not be able to perform any transaction from your account.
ar: سيتم حذف هذه المحفظة الفرعية. لن يتمكن مستخدمها من القيام بأي عملية بعد الحذف.

source: seems no agents around!
ar: يبدو أنه لايوجد وكلاء بالقرب منك في الوقت الحالي

# cashedOutClientPhone
source: client phone to cashed out
ar: رقم العميل المراد السحب له

# cashedInClientPhone
source: client phone to cashed in
ar: رقم العميل المراد الإيداع له

source: cashout code
ar: رمز عملية السحب

# agentCashoutOTPInfo
source: if client have no cashout code leave the field empty and we will send sms to him
ar: إذا كان العميل لايملك رمز العملية قم بترك الحقل فارغ وسنقوم بإرسال الرمز له

source: verify and activate
ar: التحقق والتنشيط

# appUpdateDialogTitle
source: new version of Nuqud available 😍
ar: نسخة جديدة من نقود متوفرة 😍

# appUpdateDialogDescription
source: keep your app updated and enjoy safe and updated financial experience!
ar: إبق تطبيقك محدثاُ لتسمتمع بتجربة آمنة وتحصل على أي ميزات جديدة!

# userVerified
source: user account has been activated successfully
ar: تم تفعيل حساب المستخدم بنجاح

source: client phone number
ar: رقم العميل

source: enter client phone number
ar: يرجى إدخال رقم العميل

source: verify client info
ar: التحقق من معلومات العميل

# featureDiscoveryToggleBalance
source: Toggle Balance Visibility
ar: التحكم بإظهار وإخفاء الرصيد

# featureDiscoveryToggleBalanceDesc
source: Tap the eye icon to toggle visibility of your balance.
ar: إنقر على رمز العين لكشف او إخفاء رصيدك أثناء إستخدام التطبيق

# featureDiscoveryViewNotifications
source: Notifications
ar: الإشعارات

# featureDiscoveryViewNotificationsDesc
source: Tap the bell icon to view your notifications
ar: أنقر على رمز الجرس لإستعراض أشعاراتك

# featureDiscoverySwitchAvailableWallets
source: switch wallet
ar: تغيير المحفظة

# featureDiscoverySwitchAvailableWalletsDesc
source: you can switch between your wallets/sub-wallets using this switch icon here
ar: يمكنك التغيير بين محافظك مختلفة العملة او المحافظ الفرعية من هنا

# featureDiscoveryAddWallet
source: add wallet
ar: إضافة محفظة

# featureDiscoveryAddWalletDesc
source: you can add new wallet/sub-wallet using this plus icon here
ar: يمكنك إضافة محافظ مختلفة العملة او المحافظ الفرعية من هنا

# featureDiscoveryViewTransactions
source: Transactions
ar: العمليات

# featureDiscoveryViewTransactionsDesc
source: Tap the bill icon to view your transactions
ar: إنقر على رمز الفاتورة لإستعراض العمليات الخاصة بك

# featureDiscoveryActivateClients
source: Activate Clients
ar: تنشيط العملاء

# featureDiscoveryActivateClientsDesc
source: Tap the shield icon to start client activation process
ar: إنقر على رمز الدرع للبدء بتنشيط عميل

# featureDiscoverySubWallets
source: sub-wallets
ar: المحافظ الفرعية

# featureDiscoverySubWalletsDesc
source: Tap the wallet icon to manage your sub-wallets
ar: إنقر على رمز المحفظة لإدارة محافظك الفرعية

# featureDiscoverySettings
source: Settings
ar: الإعدادات

# featureDiscoverySettingsDesc
source: Tap the gear icon to view all the app/account settings
ar: إنقر على رمز الضبط للإنتقال إلى إعدادات التطبيق والحساب

# featureDiscoveryPrintTransaction
source: print transaction
ar: طباعة العملية

# featureDiscoveryPrintTransactionDesc
source: Tap the printer icon to print the transaction or save it as pdf
ar: إنقر على رمز الطابعة لطباعة العملية او حفظها بصيغة بي دي إف

# featureDiscoveryShareTransaction
source: share transaction
ar: مشاركة العملية

# featureDiscoveryShareTransactionDesc
source: Tap the share icon to share the transaction as document anywhere
ar: يمكنك النقر على رمز المشاركة لمشاركة العملية كمستند لأي مكان آخر

# featureDiscoveryLockScreenLogin
source: lock screen login
ar: تسجيل الدخول بقفل الجهاز

# featureDiscoveryLockScreenLoginDesc
source: you can enable/disable lockScreen login from here
ar: يمكتك تفعيل وإلغاء تفعيل تسجيل الدخول بقفل الجهاز من هنا

# showRoad
source: show the road
ar: إظهار الطريق

source: no directions found
ar: لم يتم العثور على طريق

source: loading directions
ar: جاري تحميل الطريق

# distanceAndDuration
source: distance {distance} , duration {duration}
ar: المسافة {distance} , الوقت {duration}

# jailBrokenDeviceAlert
source: sorry, jail broken or rooted devices are not allowed
ar: الأجهزة المروته والمفتوحة غير مخولة باستخدام التطبيق

# emulatorDeviceAlert
source: sorry, emulator devices are not allowed
ar: الأجهزة الوهمية غير مخولة باستخدام التطبيق
