Repository: zaidmahdidev/wide_space_task
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Ebn Balady
ar: إبن بلدي

# appbar
source: Ebn Balady
ar: إبن بلدي

# hello
source: Hello to Ebn Balady
ar: أهلا بك في إبن بلدي

# helloBody
source: Press the button bellow or Drag to move
ar: إضغط على الزر في الأسفل او قم بعمل سحب للانتقال للصفحة التالية

# widespace
source: One of WideSpace's solutions to help the society
ar: أحد حلول وايدسبيس لمساعدة المجتمع

# travelTitle
source: Visiting a new country? You think you're lost?
ar: ستزور دولة جديدة؟ تظن انك ضائع؟

# travelBody
source: Don't wary, you are all set with Ebn Balady you get helps from people around you
ar: لاتقلق, انت على مايرام مع إبن بلدي ستستطيع الحصول على المساعدة من الأشخاص المحيطين بك

# rankTitle
source: Help Others and get a high rank
ar: ساعد الآخرين وقم بالترقي للحصول على مراتب عالية

# rankBody
source: You can also help other people and you'll increase your level and get new nicknames
ar: تستطيع ايضا مساعدة الآخرين وستقوم بزيادة مستواك و تحصل على القاب جديدة

# mapTitle
source: Maps, Chats, calls, and so much more!
ar: خرائط, محادثات, اتصالات, وغيره الكثير

# mapBody
source: It's not only an app, it's a platform for all people to communicate and help each others
ar: إبن بلدي ليس مجرد تطبيق عادي, هو عبارة عن منصة تمكن الناس من التواصل ومساعدة بعضهم البعض

# changeTheme
source: Choose your preferred theme
ar: قم بإختيار ثيمك المفضل

source: Country
ar: البلد

source: City
ar: المدينة

source: Neighborhood
ar: الحي

source: Welcome
ar: أهلا

source: Welcome Back
ar: أهلا بك مجددا

source: LOGIN
ar: سجل دخول

source: Requests
ar: الطلبات

source: Responses
ar: الردود

source: Friends
ar: الأصدقاء

source: See reviews
ar: تصفح التقييمات

source: Progress:
ar: التقدم:

source: Level:
ar: المستوى:

source: Nickname:
ar: اللقب:

source: No nickname
ar: لا لقب

source: Mine
ar: خاصتي

source: List
ar: قائمة

source: Unread
ar: غير مقروءة

source: Accept
ar: وافق

# interestedInYourPost
source: is interested in your post
ar: مهتم بطلبك

# hasCreatedNewPost
source: has created a new post, click to see it
ar: أنشأ طلب جديد, انقر لتراه

# hasRespondedToPostYouInterestedIn
source: has responded to a post you interested in, click to see his response
ar: قام بالرد على طلب انت مهتم به, انقر لتراه

# sentYouFriendRequest
source: has sent you a friend request
ar: أرسل اليك طلب صداقة

# givenYouAReview
source: has given you a review, click to see it
ar: قام بتقييمك, انقر لتراه

source: Congratulations,
ar: مبرووك,

# youLeveledUp
source: you leveled up to level
ar: لقد ترقيت الى المستوى

source: you got new achievement
ar: لقد حصلت على إنجاز جديد

# hasRespondedToYourPost
source: has responded to your post, click to see his response
ar: قام بالرد على طلبك, انقر لتراه

source: Basic Info:
ar: معلومات اساسية:

source: Statistics:
ar: إحصائيات:

source: Achievements:
ar: إنجازات:

# sureYouWantToQuit
source: Are you sure you want to quit?
ar: هل أنت متأكد من رغبتك في الخروج؟

# youWillLoseChanges
source: You will lose all changes
ar: سوف تفقد جميع تعديلاتك

source: Quit
ar: غادر

source: Add phone number
ar: أضف رقم تلفون

source: Phone number/numbers
ar: رقم /أرقام هاتف:

source: Your neighborhood
ar: الحي

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Choose method
ar: إختر طريقة

source: Your username
ar: إسم مستخدمك

source: Your middle name
ar: إسمك الأوسط

source: Your first name
ar: إسمك الأول

source: Your last name
ar: إسمك الأخير

source: Unexpected error!!
ar: خطأ غير متوقع!!

source: Write a description
ar: أكتب وصف

source: Write a response
ar: أكتب رداً

# responseCantBeEmpty
source: Response cannot be empty
ar: الرد لايمكن ان يكون فارغاَ

source: SHOW MORE
ar: إعرض أكثر

source: SHOW LESS
ar: إعرض أقل

# removeAuth
source: Remove your Authentication
ar: إحذف بيانات توثيقك

# noMessagesYet
source: There are no Messages yet
ar: لايوجد رسائل بعد

# noMoreResponses
source: There are no more responses
ar: لايوجد ردود أخرى

# noMoreRequests
source: There are no more requests
ar: لايوجد طلبات أخرى

source: Delete
ar: إحذف

# isDeleteResponse
source: Delete this response
ar: حذف هذا الرد؟

# isDeleteRequest
source: Delete this request?
ar: حذف هذا الطلب؟

# featureWorking
source: Working on this feature
ar: قيد العمل على هذه الميزة

# isQuit
source: Quit this app
ar: الخروج من التطبيق

source: Edit profile
ar: عدل بيانات الملف الشخصي

source: My Friends
ar: أصدقائي

source: Champions
ar: الأبطال

source: About Developer
ar: عن المطور

source: About Ebn Balady
ar: عن إبن بلدي

source: Messages
ar: الرسائل

source: Map
ar: الخريطة

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: Title
ar: العنوان

source: Edit Request
ar: تعديل الطلب

source: Add Request
ar: إضافة طلب

source: Search
ar: إبحث

source: Report
ar: تبليغ

source: Direct Message
ar: رسالة خاصة

source: Delete Request
ar: قم بحذف الطلب

source: Delete Response
ar: قم بحذف الرد

source: Edit Response
ar: عدل الرد

source: This is your account!!
ar: هذا هو حسابك!!

# notInterested
source: Search
ar: غير مهتم

source: SIGN UP
ar: سجل إشتراك

# dontHaveAccount
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ سجل إشتراك

source: Username
ar: إسم المستخدم

source: Password
ar: كلمة المرور

source: Email
ar: البريد الألكتروني

# scan
source: scan {name}
ar: مسح رمز {name}

source: wrong QR format
ar: الصورة تحمل بيانات غير صحيحة

# sureToDelete
source: are you sure you want to delete ?
ar: هل أنت متاكد من رغبتك في الأستمرار بالقيام بعملية الحذف ؟

source: Yes
ar: نعم

source: No
ar: لا

source: confirm password
ar: تأكيد كلمة المرور

source: password confirmation
ar: تأكيد كلمة المرور

# fullName
source: full name (quad)
ar: الإسم الكامل ( رباعي )

# emailOrUsernameOrPhone
source: Email, Username, or Phone number
ar: الأيميل, إسم المستخدم, او رقم الهاتف

# selectGender
source: Select Your gender
ar: إختر نوعك

# selectCountry
source: Select Your Country
ar: إختر بلدك

# selectCity
source: Select Your City
ar: إختر مدينتك

# selectDistrict
source: Select Your District
ar: إختر مديريتك

# pleaseSelectCity
source: Please Select Your City.
ar: من فضلك قم بإختيار مدينتك.

# pleaseSelectCountry
source: Please Select Your Country.
ar: من فضلك قم بإختيار بلدك.

# pleaseSelectDistrict
source: Please Select Your District.
ar: من فضلك قم بإختيار مديريتك.

# pleaseSelectGender
source: Please Select Your gender.
ar: من فضلك قم بإختيار نوعك.

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Middle Name
ar: الإسم الأوسط

source: verify
ar: تحقق

source: resend code ?
ar: إعادة إرسال الرمز ؟

# enterCode
source: Enter the code sent to
ar: قم بإدخال الكود المرسل إلى

# waitForTimer
source: please wait for the timer to complete
ar: الرجاء الإنتظار حتى إنتهاء العداد

# serverFailure
source: sorry , we couldn't connect with the server right now
ar: عذراً لم نتمكن من الاتصال بالخادم

# cacheFailure
source: No data try to connect to the internet
ar: لاتوجد بيانات حتى الان حاول الإتصال بالإنترنت

# connectionFailure
source: No internet Connection!
ar: لايوجد اتصال بالانترنت!

# notFoundFailure
source: No data for now !
ar: لاتوجد أي بيانات في الوقت الحالي!

# invalidFailure
source: Incorrect Input
ar: هناك خطا في البيانات المدخلة

# invalidCode
source: Incorrect Verification Code
ar: رمز التحقق غير صحيح

# expireFailure
source: Expired
ar: انتهت صلاحية الكود

# userExistsFailure
source: No Account with this Credentials
ar: لايوجد حساب بهذه البيانات! تأكد من البيانات.

# uniqueFailure
source: This account already exist
ar: قد يكون هذا الحساب موجود مسبقاً! حاول تغيير رقم الهاتف

# passwordFailure
source: Incorrect Credentials
ar: كلمة المرور غير صحيحة

# receiveFailure
source: Error Happened While Retrieving Data
ar: حدث خطأ اثناء استقبال البيانات

# unauthenticatedFailure
source: Sorry you are not authenticated, please try again
ar: عذرا ! قم بتجسيل الدخول مرة أخرى والمحاولة

# blockedFailure
source: Sorry your account is blocked contact with admins to review
ar: عذرا ! لقد تم حظر حسابك. يرجى التواصل مع المسؤول لإزالة الحظر

# unexpectedFailure
source: Sorry Unexpected Error just happened :) try later
ar: عذرا حدث خطأ غير متوقع , يرجى المحاولة لاحقاُ

# seeAll
source: View all
ar: عرض الكل

source: Overview
ar: الرئيسية

source: Settings
ar: الإعدادات

# otpReSent
source: otp has been resent
ar: تم إرسال الرمز بنجاح

source: notifications
ar: الإشعارات

source: account
ar: الحساب

source: First Name
ar: الإسم الأول

source: Last Name
ar: الإسم الأخير

# onBoardingTitle1
source: Visiting a new place? You don’t want to be lost?
ar: تزور منطقة جديدة؟ لاتريد ان تضيع؟

# onBoardingBody1
source: Don’t worry Ebn Balady is set for you! People here will help.
ar: لا تقلق, فإبن بلدي معد لك خصيصاَ

# onBoardingTitle2
source: Be a “helper” and get a High Rank !
ar: كن مساعداَ, وأخصل على مرتبة عالية !

# onBoardingBody2
source: you can help others, and increase your level to get a new “Nickname”
ar: تستطيع مساعدة الآخرين, وزيادة مستواك للحصول على “لقب”

# onBoardingBody3
source: Let’s build a helping community!
ar: هيا فالنبني مجتمعاَ مساعداَ !

source: Phone Number
ar: رقم الهاتف

source: Account Details
ar: تفاصيل الحساب

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Use
ar: شروط الإستخدام

source: App
ar: التطبيق

source: Support
ar: الدعم

source: App Version
ar: إصدار التطبيق

source: logout
ar: سجل خروج

# isLogout
source: logout?
ar: تسجيل الخروج؟

source: language
ar: اللغة

source: About
ar: عن التطبيق

source: confirm
ar: تأكيد

source: Home
ar: الرئيسية

source: save
ar: حفظ

source: next
ar: التالي

source: governorate
ar: المحافظة

source: District
ar: المديرية

source: birth date
ar: تاريخ الميلاد

source: birth place
ar: مكان الميلاد

source: profile
ar: الملف الشخصي

source: update profile
ar: تحديث الملف الشخصي

source: profile updated
ar: تم تحديث البيانات

source: security
ar: الحماية

source: Change password
ar: تغيير كلمة المرور

source: Change email
ar: تغيير الايميل

# passwordChanged
source: Password has been changed
ar: تم تغيير كلمة المرور

# emailChanged
source: Email has been changed
ar: تم تغيير الإيميل

source: old password
ar: كلمة المرور القديمة

source: old email
ar: الإيميل القديم

source: new password
ar: كلمة المرور الجديدة

source: new email
ar: الإيميل الجديد

# newPasswordConfirmation
source: confirm new password
ar: تأكيد كلمة المرور الجديدة

# newEmailConfirmation
source: confirm new email
ar: تأكيد الإيميل

# enableLockScreenLogin
source: use lock screen to login
ar: تفعيل الدخول برمز الجهاز

source: No More Notifications
ar: لا يوجد إشعارات أخرى

source: All
ar: الكل

source: date
ar: التاريخ

source: time
ar: الوقت

source: description
ar: الوصف

source: cancel
ar: إلغاء

source: add
ar: إضافة

source: update
ar: تحديث

source: done
ar: تم

source: done successfully
ar: تم بنجاح

# didYouForgetPassword
source: forget password ?
ar: هل نسيت الرمز ؟

source: Forget password
ar: نسيت الرمز

# forgetPasswordDescription
source: Enter your phone number for the verification process , we will send you 6 digits code to your number as an SMS message.
ar: قم بإدخال رقم هاتفك لإجراء التحقق , سيتم إرسال كود مكون من 6 أرقام إلى هاتفك كرسالة نصية SMS

# enterSixDigitsCode
source: Enter 6 Digits Code
ar: إدخال رمز التأكيد

# enterSixDigitsCodeDescription
source: Enter the 6 Digits Code that you received on your mobile.
ar: قم بإدخال الكود المكون من 6 أرقام المرسل إلى هاتفك.

source: Reset password
ar: إعادة تعيين كلمة

# resetPasswordDescription
source: Set the new password for your account so you can login and access all features.
ar: قم بإدخال كلمة المرور الجديدة لحسابك لتتمكن من تسجيل الدخول والوصول لكافة الخدمات.

# otpSent
source: verification code has been sent to your number
ar: تم إرسال رمز التحقق لرقم هاتفك

source: previous
ar: السابق

# sendOTP
source: send verification code
ar: إرسال رمز التحقق

source: number
ar: الرقم

# shareApp
source: share the app
ar: مشاركة التطبيق

# otp
source: transaction OTP
ar: رمز تحقق العملية

source: not now
ar: ليس الآن

# appSlogan
source: With you all over the world
ar: معك في كل مكان حول العالم

source: Login
ar: تسجيل الدخول

source: user name
ar: إسم المستخدم

source: Text copied to clipboard
ar: تم نسخ النص للحافظة

# dontHaveAccountQuestion
source: Register Your Account for First Time
ar: تسجيل الحساب لأول مرة

# registerYourAccount
source: Already Registered ?
ar: مسجل مسبقاً ؟

source: No messages till now
ar: لا رسائل حتى الان

source: No conversations till now
ar: لا محادثات حتى الان

source: Write message
ar: أكتب رسالة

source: camera photo
ar: صورة بالكاميرا

source: Gallery photo
ar: صورة من المعرض

source: Camera Video
ar: فيديو بالكاميرا

source: Gallery Video
ar: فيديو من المعرض

source: Chats
ar: محادثات

source: Add New Wallet
ar: إضافة محفظة جديدة

# checkInternetConnection
source: Check your Internet connection
ar: تأكد من إتصالك بالإنتر نت

source: Voice message
ar: رسالة صوتية

source: Video message
ar: رسالة فيديو

source: Swipe to cancel
ar: مرر للإلغاء

source: Recent Transactions
ar: آخر العمليات

source: Sub-wallet Transactions
ar: عمليات المحفظة الفرعية

source: Transactions
ar: العمليات

source: Market
ar: المتجر

source: Send
ar: إرسال

# pillPay
source: pay bills
ar: سداد

source: mPIN
ar: المعرف الشخصي

# confirmMPIN
source: confirm your mPIN
ar: تاكيد المعرف الشخصي

source: account number
ar: رقم الحساب

source: customer ID
ar: معرف المستخدم

source: start
ar: ابدأ

source: Loans
ar: القروض

source: Fund transfer
ar: تحويل أموال

source: Due Amount
ar: المستحق

source: Paid
ar: المدفوع

source: One Time Transfer
ar: التحويل لمرة واحدة

source: beneficiaries
ar: مجموعة مستفيدين

source: View Statement
ar: عرض العمليات

source: Transfer to Account Number
ar: التحويل إلى رقم حساب

source: Repeat Transactions
ar: تكرار عملية سابقة

source: receiver account number
ar: رقم حساب المستلم

source: amount
ar: المبلغ

source: note
ar: ملاحظات

source: choose Account
ar: إختر الحساب

# transferredSuccessfully
source: amount transferred successfully
ar: تم تحول المبلغ بنجاح

source: receiver
ar: المستقبل

source: gross
ar: إجمالي المبلغ

source: net
ar: الصافي

source: fee
ar: الرسوم

source: Add Loan
ar: إضافة قرض

source: choose product
ar: إخترالمنتج

source: choose branch
ar: إختر الفرع

source: choose purpose
ar: إختر الغرض

source: choose category
ar: إختر القطاع

source: choose activity
ar: إختر النشاط

# activityNote
source: activities will appear after choosing category
ar: ستظهر الأنشطة بعد إختيار القطاع

# requestConfirm
source: are you sure you want to continue ?
ar: هل أنت متأكد من أنك تريد الإستمرار

# loanAddedSuccessfully
source: Loan Request is sent Successfully
ar: تم إرسال طلب القرض بنجاح

source: TopUp
ar: شحن

source: Hi
ar: مرحباً

source: To:
ar: إلى:

source: From:
ar: من:

source: Hospitals
ar: مستشفيات

source: Hotels
ar: فنادق

source: Work
ar: عمل

source: Studying
ar: دراسة

source: eating
ar: أكل

source: Pick Date
ar: إختر تاريخاَ

source: Filter by people
ar: فلتر بالاشخاص

source: Topics
ar: مواضيع

source: sub-wallet
ar: محفظة فرعية

# youBalance
source: Your Balance is
ar: رصيدك هو

# subWalletFor
source: sub-wallet for {name}
ar: محفظة فرعية ل{name}

# chooseWallet
source: choose wallet to change
ar: إختر لتغيير المحفظة

source: Activate
ar: تنشيط

# notActivated
source: Your account is not activated
ar: الحساب غير مفعل

# notActivatedDescription
source: please press the button below to go through the activation process
ar: الرجاء الضغط على الزر ادناه لإستكمال عملية التفعيل

# visitAgent
source: go to nearest agent
ar: يرجى التوجه لأقرب وكيل

# visitAgentDescription
source: please visit your nearest agent to complete verification and to start using all services.
ar: الرجاء زيارة أقرب وكيل للتأكد من البيانات واستكمال التفعيل والتمتع بكامل الخدمات

# noTransactions
source: No transactions available in this wallet
ar: لا يوجد عمليات في هذه المحفظة في الوقت الحالي

# noTransactionsInSub
source: No transactions available in this sub-wallet
ar: لا يوجد عمليات في هذه المحفظة الفرعية في الوقت الحالي

# subWalletDescription
source: allows selected person to use your wallet with predefined permissionsُ
ar: تخويل الأخرين لإستخدام محفظتك بصلاحيات محددة مسبقاُ

source: main wallet
ar: محفظة رئيسية

# mainWalletDescription
source: create main wallet with different currency
ar: إنشاء محفظة بعملة أخرى

source: choose wallet type
ar: إختر نوع المحفظة

# completeAccountData
source: complete your account
ar: إكمال بيانات الحساب

source: Merchant identity
ar: هوية المتجر

# merchantIdentityInfo
source: Upload your shop logo and details
ar: ارفق هوية (شعار) وتفاصيل الخاص بك

# uploadIdentity
source: Personal identity
ar: البطاقة الشخصية

# uploadIdentityInfo
source: Upload your personal identity
ar: ارفق هويتك / البطاقة الشخصية

# verifyIdentity
source: Verify
ar: التحقق

# verifyIdentityInfo
source: Verify your personal data
ar: تحقق من بياناتك الشخصية

source: Front image
ar: الصورة الأمامية

source: Back image
ar: الصورة الخلفية

# uploadImageValidation
source: Image must be loaded
ar: يجب رفع الصورة

# uploadDocumentImagesValidation
source: ID images must be uploaded
ar: يجب رفع صور الوثائق

# merchantShopName
source: shop name
ar: إسم المتجر

source: ID number
ar: رقم الهوية

source: user
ar: مستخدم

source: merchant
ar: تاجر

source: choose account type
ar: إختر نوع الحساب

source: display name
ar: إسم العرض

source: undefined
ar: غير محدد

# mustBeVerified
source: account must be activated first
ar: يجب تنشيط الحساب اولاً

# pleaseAuth
source: Please authenticate to access your account
ar: الرجاء المصادقة للوصول الى حسابك

# noMoreTransactions
source: No More Transactions Available
ar: لا يوجد عمليات أخرى

source: Income
ar: دخل

source: Outcome
ar: خرج

source: price rate
ar: فارق السعر

source: state
ar: الحالة

source: completed
ar: مكتملة

source: rejected
ar: مرفوضة

source: pending
ar: قيد الإنتضار

source: canceled
ar: ملغية

source: reversed
ar: مسترجعة

# aboutEbnBaladyText
source: This app has been created to build a solid community and to increase the spirit of help between people. If you moved from your country to another and you need help from people whom are from your society You can quickly ask it, and you’ll be served immediately. On the other hand, every time you help others you’ll be highly ranked and ou will be known as a loyal helper!
ar: تم إنشاء هذا التطبيق لبناء مجتمع قوي ولزيادة روح المساعدة بين الناس. إذا انتقلت من بلدك إلى بلد آخر وتحتاج إلى مساعدة من أشخاص من مجتمعك ، فيمكنك أن تطلب ذلك بسرعة ، وستتم خدمتك على الفور ، ومن ناحية أخرى ، في كل مرة تساعد فيها الآخرين ، ستحصل على مرتبة عالية و ستعرف كمساعد مخلص!

# aboutWideSpaceText
source: WideSpace is a developing company that aims to deliver services that help the community reach extraordinary developed apps.
ar: وايد سبيس هي شركة نامية تهدف إلى تقديم الخدمات التي تساعد المجتمع على الوصول إلى تطبيقات مطورة غير عادية.

source: Our Products
ar: منتجاتنا

source: requested
ar: تحت الطلب

source: scheduled
ar: مجدولة

source: unknown
ar: غير معروفة

source: type
ar: النوع

source: reject
ar: أرفض

source: the top
ar: المرتبة

source: in the city
ar: في المدينة

source: choose wallet currency
ar: إختر عملة المحفظة

# walletAdded
source: wallet has been created successfully
ar: تم إنشاء المحفظة بنجاح

# subWalletAdded
source: sub-wallet has been created successfully
ar: تم إنشاء المحفظة الفرعية بنجاح

# subWalletEdited
source: sub-wallet has been updated successfully
ar: تم تعديل المحفظة الفرعية بنجاح

# youHaveAllWalletTypesAvailable
source: you have all wallet currencies available
ar: لديك كل عملات المحافظ المتاحة في الوقت الحالي

source: Add New Sub-wallet
ar: إضافة محفظة فرعية جديدة

source: edit Sub-Wallet
ar: تعديل المحفظة الفرعية

# subWalletUserPhone
source: sub-wallet user phone number
ar: رقم المستخدم للمحفظة الفرعية

# subWalletUserInfo
source: sub-wallet user information
ar: بيانات المستخدم للمحفظة الفرعية

source: choose sub-wallet type
ar: إختر نوع المحفظة الفرعية

# chooseSubWalletSubType
source: choose sub-wallet detail
ar: إختيار تفاصيل النوع

# chooseWalletForSubWallet
source: wallet to create sub-wallet from
ar: إختر المحفظة التي سيتم الإنشاء منها

# userNotFound
source: user not found please type user name and we will send him invitation link
ar: المستخدم غير موجود يرجى ادخال الإسم وسيتم إرسال رابط دعوة

# userNotFoundViral
source: user not found please type user name and we will send him a viral transaction that can be received from our agents
ar: المستخدم غير موجود يرجى ادخال الإسم وسيتم إرسال المبلغ كحوالة يتم إستلامها من وكلائنا

# permissionsAndLimitations
source: permissions and limitation
ar: تحديد الصلاحيات و الحدود

source: repetition every day
ar: التكرار للعملية كل يوم

source: maximum amount
ar: أقصى مبلغ

source: show sub-wallet to others
ar: عرض المحفظة الفرعية للآخرين

# showSubWalletToOthersDesc
source: others can choose between making operations towards your main wallet or sub-wallet
ar: يمكن لللآخرين الإختيار بين القيام بالعمليات بإتجاه المحفظة الأساسية او المحفظة الفرعية

# subWalletSetting
source: sub-wallet settings
ar: إعدادات المحفظة الفرعية

source: active
ar: مفعلة

source: disabled
ar: غير مفعلة

# activeDescription
source: when disabled the permitted user will not be able to do any transaction using this sub-wallet
ar: عند إيقاف التفعيل لن يتمكن المستخدم المخول من تنفيذ اي عملية بإستخدام المحفظة الفرعية

source: sub-wallets
ar: المحافظ الفرعية

source: typeAndSubtypeValidation
ar: يجب تحديد النوع وتفاصيل النوع

# permissionsValidation
source: at least one service permission should be selected
ar: يجب إختيار صلاحية على خدمة واحدة على الأقل

# noSubWalletsYet
source: you have no sub-wallets added yet in this wallet
ar: لا يوجد لديك محافظ فرعية حتى الآن في هذه المحفظة

# lost
source: oh we are lost! .. go back
ar: يبدوا أننا ضائعون ! عد للخلف

source: send money
ar: إرسال أموال

# waitTillFinished
source: please wait until Request is finished
ar: يرجى الإنتظار حتى إنتهاء العملية

source: receiver phone
ar: رقم المستلم

source: receiver name
ar: إسم المستلم

# sureToLogout
source: Are you sure you want to logout ?
ar: هل أنت متأكد من رغبتك في تسجيل الخروج

# nextTimeSecurity
source: You will have to enter password instead of lockscreen security method.
ar: سيجب عليك تسجيل الدخول مستخدمأ كلمة المرور بدلا عن قفل الشاشة

# confirmTransactionCompletion
source: Are you sure you want to complete this transaction ?
ar: هل أنت متأكد من رغبتك في إتمام هذه العملية ؟

# chooseWalletForSend
source: choose the target wallet
ar: إختر المحفظة المقصودة

# userHasMoreThanWallet
source: user has more than wallet connected to his account choose which wallet to perform operation toward
ar: يمتلك هذا المستخدم أكثر من محفظة مرتبطة بحسابه اختر لأي محفظة تريد تنفيذ العملية

# receiveUserNotFound
source: receiver number not found please make sure the number is correct
ar: الشخص المراد الإستلام منه غير مسجل في النظام يرجى التأكد من الرقم

# cashoutUserNotFound
source: cashed out number not found please make sure the number is correct
ar: الشخص المراد السحب منه غير مسجل في النظام يرجى التأكد من الرقم

# cashinUserNotFound
source: cashed in number not found please make sure the number is correct
ar: الشخص المراد السحب له غير مسجل في النظام يرجى التأكد من الرقم

# noNotifications
source: you have no notifications yet .. enjoy ❤
ar: لايوجد لديك أي إشعارات ... إستمتع ❤

# subWalletAccepted
source: you have accepted the sub-wallet invitation
ar: لقد قبلت الدعوة بأن تكون محفظة فرعية

# subWalletRejected
source: you have rejected the sub-wallet invitation
ar: لقد رفضت الدعوة بأن تكون محفظة فرعية

source: choose type
ar: إختر النوع

# serviceHasMoreOptions
source: this service has more than one type you can choose the type you want
ar: هذه الخدمة تمتلك أكثر من نوع يرجى اختيار النوع الذي تريده

source: choose service option
ar: إختر تفاصيل الخدمة

# amountFieldCanBeLeftEmpty
source: you can leave the amount field empty to pay the full amount
ar: يمكنك ترك حقل المبلغ فارغ لسداد المبلغ كاملاً

# serviceOptionCantBeEmpty
source: service option can not be empty
ar: يجب إختيار تفاصيل الخدمة
